import os
import sys

from natasha import NewsEmbedding, NewsMorphTagger, Segmenter, NewsSyntaxParser, NewsNERTagger

if getattr(sys, 'frozen', False):
    NEWS_EMBEDDING = os.path.join(sys._MEIPASS, "navec_news_v1_1B_250K_300d_100q.tar")
    NEWS_MORPH = os.path.join(sys._MEIPASS, "slovnet_morph_news_v1.tar")
    NEWS_SYNTAX = os.path.join(sys._MEIPASS, "slovnet_syntax_news_v1.tar")
    NEWS_NER = os.path.join(sys._MEIPASS, "slovnet_ner_news_v1.tar")
    DICTS = os.path.join(sys._MEIPASS, "dicts")
else:
    NEWS_EMBEDDING = os.path.join("navec_news_v1_1B_250K_300d_100q.tar")
    NEWS_MORPH = os.path.join("slovnet_morph_news_v1.tar")
    NEWS_SYNTAX = os.path.join("slovnet_syntax_news_v1.tar")
    NEWS_NER = os.path.join("slovnet_ner_news_v1.tar")
    DICTS = "dicts"

emb = NewsEmbedding(path=NEWS_EMBEDDING)
morph_tagger = NewsMorphTagger(emb, path=NEWS_MORPH)
segmenter = Segmenter()
syntax_parser = NewsSyntaxParser(emb, path=NEWS_SYNTAX)
ner_tagger = NewsNERTagger(emb, path=NEWS_NER)
NARRATOR = -1

DETPRON = {
    "Fem": {
        '3': ["ее", "её"],
        '1': ['мой', 'моя', 'моё', 'мое', 'мои', 'моего', 'моей', 'моих', 'моему', 'моим', 'мою', 'моим', 'моею',
              'моими', 'моем', 'моём']
    },
    "Masc": {
        '3': ['его'],
        '1': ['мой', 'моя', 'моё', 'мое', 'мои', 'моего', 'моей', 'моих', 'моему', 'моим', 'мою', 'моим', 'моею',
              'моими', 'моем', 'моём']
    }
}

OPEN = 0
CLOSE = 1
BOTH = 2
QUOTES = {
    "«": (0, OPEN),
    "‹": (1, OPEN),
    "»": (0, CLOSE),
    "›": (1, CLOSE),
    "„": (2, OPEN),
    "“": (2, CLOSE),
    "‟": (3, CLOSE),
    "”": (3, CLOSE),
    "’": (4, BOTH),
    "\u0022": (5, BOTH),
    "\u275D": (6, OPEN),
    "\u275E": (6, CLOSE),
    "\u301E": (7, OPEN),
    "\u301F": (7, CLOSE),
    "＂": (8, BOTH),
}

SELFDETERMINERS = {
    'своим': 'своим',
    'своем': 'своем',
    'своя': 'своя',
    'своими': 'своими',
    'своих': 'своих',
    'своею': 'своею',
    'свое': 'свое',
    'своей': 'своей',
    'свои': 'свои',
    'своему': 'своему',
    'свою': 'свою',
    'свой': 'свой',
    'своём': 'своём',
    'своего': 'своего',
    'своё': 'своё',
}

MYDETERMINERS = {
    'мою': 'свою',
    'мое': 'свое ',
    'моего': 'своего',
    'моими': 'своими',
    'моём': 'своём',
    'моё': 'своё',
    'моим': 'своим',
    'мой': 'свой',
    'моих': 'своих',
    'мои': 'свои',
    'моя': 'своя',
    'моей': 'своей',
    'моем': 'своем',
    'моему': 'своему',
    'нашими': 'нашими',
    'наше': 'наше',
    'наших': 'наших',
    'нашем': 'нашем',
    'наш': 'наш',
    'наша': 'наша',
    'нашего': 'нашего',
    'нашим': 'нашим',
    'наши': 'наши',
    'нашу': 'нашу',
    'нашему': 'нашему',
    'нашей': 'нашей',
}

FEM_TEXT1 = ("""По существу заданных вопросов могу пояснить, что
# по вышеуказанному адресу проживаю с родителями Совуновой Аллой Николаевной и
# Совуновым Вадимом Евгеньевичем. В свободное от обучения в средней общеобразовательной школе № 96 время я занимаюсь в цирковой студии «Престиж», с которой периодически выступаю, в том числе с выездом.
# Так, 11.05.2015 года я с напарником по цирковой студии Галич Денисом Юрьевичем
# поехали в г. Челябинск на выступление в ледовой арене «Трактор». 19.05.2015 года я с Галич Д.Ю. возвращались обратно в г. Омск, для чего на станции Челябинск мы осуществили
# посадку в пассажирский поезд № 098 сообщением «Кисловодск-Тында» в вагон № 14 на
# места № 22, 24, 26. На одном месте находился реквизит. Осуществив посадку и заняв свои
# места мы легли спать, телефон был все время при мне, однако перед тем как лечь спать он
# выключился, т.к. сел заряд аккумулятора. Проснувшись утром по станции Петропавловск
# мы находились на своих местах, так как в вагоне работали пограничники, проводили проверку пассажиров. В вагоне было много пассажиров, некоторые из них в пути следования
# распивали спиртные напитки. В том числе в вагоне из числа пассажиров были военнослужащие, других отличительных признаков я не запомнила. После того как проводник прошел по вагону и предупредил, что до станции Омск оставалось около 15 минут, я решила
# пойти поставить свой мобильный телефон на зарядку для того, чтобы позвонить маме и
# сказать о прибытии поезда. Так, я прошла в нерабочий тамбур, где напротив туалета над
# окном поставила свой мобильный телефон заряжаться, положив его на верхний уступ окна.
# В момент, когда я ставила телефон на зарядку, в тамбуре напротив туалета стоял проводник вагона, он видел все мои действия. Проводник дожидался пассажира, который находился в туалете, для того чтобы закрыть туалет перед прибытием на станцию Омск. Поставив телефон на зарядку я решила вернуться на свое место, через минуту за мной вышел из
# тамбура и проводник и прошел к себе. Я находилась на свое месте около 7-10 минут, после
# чего решила проверить свой мобильный телефон. Также у меня вызвала подозрение женщина, на вид цыганка, которая прошла в сторону туалета. Так, подойдя к нерабочему тамбуру я увидела, что в розетке осталось только зарядное устройство от моего мобильного
# телефона, самого телефона не было. Я сразу поняла, что его похитили и пошла к проводнику, сообщила о случившемся, на что проводник ответил что по станции Омск вызовет сотрудников полиции для разбирательств.
# По прибытию на станцию Омск в вагон зашли сотрудники полиции , которым я указала на место где стоял телефон на зарядке и устно объяснила, что случилось. После этого я
# сошла по станции Омск вместе с одним из сотрудников полиции и проследовали в дежурную часть Омского ЛУ МВД России, где в присутствии мама – Совуновой Аллы Николаевны я написала заявление и меня опросили сотрудники полиции по факту случившегося.
# Также поясняю, что мобильный телефон у меня был марки «Iphone» модель «4s», IMEI 013532009242428 в корпусе белого цвета. На момент хищения мобильный телефон находился в чехле черного цвета, на задней стенке чехла изображена девушка с фотоаппаратом. Телефон не имел трещин, сколов иных механических повреждений. Мобильный телефон приобретался за 18 000 рублей примерно в сентябре 2014 года, при этом в данную
# сумму входила его настройка. В настоящее время с учетом износа, я оцениваю мобильный
# телефон в 13 500 рублей 00 копеек, как указано в чеке, который я готова выдать. Чехол для
# меня материальной ценности не представляет. На момент хищения в мобильном телефоне
# находилась сим-карта оператора ОАО «МТС» с абонентским номером +79835288572. Симкарта материальной ценности сим-карта для меня не представляет, денежных средств на
# момент хищения на сим-карте не было. Данный абонентский номер оформлен на моего папу – Совунова Вадима Евгеньевича.
# Также хочу пояснить, что за выступления в цирковой группе я получаю денежные
# средства. Оплата за наши выступления сдельная, выступаем на бездоговорной основе. В
# среднем один час выступления стоит от 1 500 рублей, в зависимости от сложности номера.
# В месяц примерно я зарабатываю от 8 000 до 10 000 рублей. Именно с данных денежных
# средств был куплен похищенный у меня мобильный телефон, кроме того, из заработанных
# денег - часть заработка идет на оплату поездок, покупку билетов на транспорт, поэтому, в
# силу того, что я еще обучаюсь в школе, постоянного заработка не имею, и нахожусь на иждивении родителей в связи с чем, ущерб на сумму 13 500 рублей 00 копеек причиненный
# мне, является для меня значительным. Мобильный телефон покупался в рассрочку, которая
# была оформлена на мою маму – Совунову А.Н., однако денежные средства вносила я, по
# мере их получения за выступления.
# В настоящее время при мне находится коробка от мобильного телефона марки
# «Iphone» модель «4s», IMEI 013532009242428 в корпусе белого цвета, два электронных билета на листах А4, копия свидетельства о рождении на мое имя, а также электронная выписка чека из магазина «Связной» и документы из магазина, где приобретали мобильных
# телефон. Данные предметы и документы я готова выдать.
# Больше по данному факту мне пояснить нечего. """, "Совунова А.Л")
