DETPRON = {
    "Fem": {
        '3': ["ее", "её"],
        '1': ['мой', 'моя', 'моё', 'мое', 'мои', 'моего', 'моей', 'моих', 'моему', 'моим', 'мою', 'моим', 'моею',
              'моими', 'моем', 'моём']
    },
    "Masc": {
        '3': ['его'],
        '1': ['мой', 'моя', 'моё', 'мое', 'мои', 'моего', 'моей', 'моих', 'моему', 'моим', 'мою', 'моим', 'моею',
              'моими', 'моем', 'моём']
    }
}

SELFDETERMINERS = {
    'своим': 'своим',
    'своем': 'своем',
    'своя': 'своя',
    'своими': 'своими',
    'своих': 'своих',
    'своею': 'своею',
    'свое': 'свое',
    'своей': 'своей',
    'свои': 'свои',
    'своему': 'своему',
    'свою': 'свою',
    'свой': 'свой',
    'своём': 'своём',
    'своего': 'своего',
    'своё': 'своё',
}

MYDETERMINERS = {
    'мою': 'свою',
    'мое ': 'свое ',
    'моего': 'своего',
    'моими': 'своими',
    'моём': 'своём',
    'моё': 'своё',
    'моим': 'своим',
    'мой': 'свой',
    'моих': 'своих',
    'мои': 'свои',
    'моя': 'своя',
    'моей': 'своей',
    'моем': 'своем',
    'моему': 'своему',
    'нашими': 'нашими',
    'наше': 'наше',
    'наших': 'наших',
    'нашем': 'нашем',
    'наш': 'наш',
    'наша': 'наша',
    'нашего': 'нашего',
    'нашим': 'нашим',
    'наши': 'наши',
    'нашу': 'нашу',
    'нашему': 'нашему',
    'нашей': 'нашей',
}
